In [5]:
sqldf('''
SELECT name, test_10_score FROM scores WHERE test_10_score > 90;
''')

       name  test_10_score
0      Liam             94
1      Noah             92
2       Ava             98
3  Isabella             94
4     James            100
5     Lucas             97
6     Ethan             93